function Main() {
  return (
    <div>
      <h2>Тестове завдання №1</h2>
      <h4>
        Реалізуйте компонент на React, який дозволяє користувачу вводити набір
        чисел (через інпут, кнопки “Додати”/“Видалити”) та відображає такі дані:
      </h4>
      <ul>
        <li>Список введених чисел.</li>
        <li>Середнє арифметичне чисел.</li>
        <li>Найменше та найбільше число в списку.</li>
        <li>Можливість видалити будь-яке число зі списку.</li>
      </ul>
      <h4>Вимоги:</h4>
      <ul>
        <li>
          Використання AI або генераторів коду (ChatGPT, Copilot, Gemini та
          інші) суворо заборонено.
        </li>
        <li>Код має бути чистим, структурованим, з коментарями.</li>
        <li>
          Додайте коротке пояснення (до 1 сторінки), як ви реалізували завдання,
          на що звертали увагу та які рішення приймали.
        </li>
      </ul>
      <p>
        <b>Формат задачі:</b> репозиторій на GitHub (надішліть посилання у
        відповідь на цей лист) або архів із проектом (у відповідь на цей лист).
      </p>
      <p>
        <b>Дедлайн:</b> середа, 21 травня 2025 року, 14:00 за київським часом.
      </p>
    </div>
  );
}

export default Main;
